Tekla Open API Reference for Tekla Structures 2025
BaseWeld.ElectrodeClassification Property
 Gets or sets the weld electrode classification.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BaseWeld.WeldElectrodeClassificationEnum ElectrodeClassification { get; set; }
Public Property ElectrodeClassification As BaseWeld.WeldElectrodeClassificationEnum
	Get
	Set
Property Value
Type: BaseWeld.WeldElectrodeClassificationEnum
See Also
Reference
BaseWeld Class
Tekla.Structures.Model Namespace